app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)

    if @song.save
---
INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "time after time"], ["created_at", "2019-09-13 14:55:09.297273"], ["updated_at", "2019-09-13 14:55:09.297273"], ["artist_id", 1]]